# \> Фильтры (2/2)
Отберите пользователей, которые не из России и при этом либо их экспериментальная группа не `0` и не `3` или их город – Минск.

Напишите через пробел первые 4 ID в такой выдаче.

In [3]:
import pandas as pd
from db_con import connection

sql_query = """
    select
        id
        , country
        , exp_group
        , city
    from "user"
    where True
        and country != 'Russia'
        and exp_group != 0
        and exp_group != 3
        or city = 'Minsk'
"""
df = pd.read_sql(
    sql_query,
    con=connection
)
df.info()
df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12476 entries, 0 to 12475
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   id         12476 non-null  int64
 1   country    12476 non-null  object
 2   exp_group  12476 non-null  int64
 3   city       12476 non-null  object
dtypes: int64(2), object(2)
memory usage: 390.0+ KB

    id     country  exp_group       city
0  211     Belarus          0      Minsk
1  213     Ukraine          2  Kamianske
2  216     Ukraine          1       Lviv
3  218     Belarus          2      Minsk
4  228  Azerbaijan          2       Baku

In [6]:
df.iloc[0:4]['id']

0    211
1    213
2    216
3    218
Name: id, dtype: int64